STMicroelectronics/stm32ai-modelzoo/human_activity_recognition/getting_started/Drivers/BSP/Components/iis3dwb/iis3dwb_reg.h
#define IIS3DWB_ALL_INT_SRC                  0x1AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01              : 1;
  uint8_t wu_ia                    : 1;
  uint8_t not_used_02              : 3;
  uint8_t sleep_change             : 1;
  uint8_t not_used_03              : 1;
  uint8_t timestamp_endcount       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp_endcount       : 1;
  uint8_t not_used_03              : 1;
  uint8_t sleep_change             : 1;
  uint8_t not_used_02              : 3;
  uint8_t wu_ia                    : 1;
  uint8_t not_used_01              : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_all_int_src_t;

#define IIS3DWB_WAKE_UP_SRC                  0x1BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t z_wu                     : 1;
  uint8_t y_wu                     : 1;
  uint8_t x_wu                     : 1;
  uint8_t wu_ia                    : 1;
  uint8_t sleep_state_ia           : 1;
  uint8_t not_used_01              : 1;
  uint8_t sleep_change_ia          : 1;
  uint8_t not_used_02              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_02              : 1;
  uint8_t sleep_change_ia          : 1;
  uint8_t not_used_01              : 1;
  uint8_t sleep_state_ia           : 1;
  uint8_t wu_ia                    : 1;
  uint8_t x_wu                     : 1;
  uint8_t y_wu                     : 1;
  uint8_t z_wu                     : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_wake_up_src_t;

#define IIS3DWB_STATUS_REG                   0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlda                     : 1;
  uint8_t not_used_01              : 1;
  uint8_t tda                      : 1;
  uint8_t not_used_02              : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_02              : 5;
  uint8_t tda                      : 1;
  uint8_t not_used_01              : 1;
  uint8_t xlda                     : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_status_reg_t;

#define IIS3DWB_OUT_TEMP_L                   0x20U
#define IIS3DWB_OUT_TEMP_H                   0x21U
#define IIS3DWB_OUTX_L_A                     0x28U
#define IIS3DWB_OUTX_H_A                     0x29U
#define IIS3DWB_OUTY_L_A                     0x2AU
#define IIS3DWB_OUTY_H_A                     0x2BU
#define IIS3DWB_OUTZ_L_A                     0x2CU
#define IIS3DWB_OUTZ_H_A                     0x2DU
#define IIS3DWB_FIFO_STATUS1                 0x3AU
typedef struct
{
  uint8_t diff_fifo                : 8;
} iis3dwb_fifo_status1_t;

#define IIS3DWB_FIFO_STATUS2                 0x3BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t diff_fifo                : 2;
  uint8_t not_used_01              : 1;
  uint8_t over_run_latched         : 1;
  uint8_t counter_bdr_ia           : 1;
  uint8_t fifo_full_ia             : 1;
  uint8_t fifo_ovr_ia              : 1;
  uint8_t fifo_wtm_ia              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_wtm_ia              : 1;
  uint8_t fifo_ovr_ia              : 1;
  uint8_t fifo_full_ia             : 1;
  uint8_t counter_bdr_ia           : 1;
  uint8_t over_run_latched         : 1;
  uint8_t not_used_01              : 1;
  uint8_t diff_fifo                : 2;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_fifo_status2_t;

#define IIS3DWB_TIMESTAMP0                   0x40U
#define IIS3DWB_TIMESTAMP1                   0x41U
#define IIS3DWB_TIMESTAMP2                   0x42U
#define IIS3DWB_TIMESTAMP3                   0x43U
#define IIS3DWB_SLOPE_EN                     0x56U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t lir                      : 1;
  uint8_t not_used_01              : 3;
  uint8_t slope_fds                : 1;
  uint8_t sleep_status_on_int      : 1;
  uint8_t not_used_02              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_02              : 2;
  uint8_t sleep_status_on_int      : 1;
  uint8_t slope_fds                : 1;
  uint8_t not_used_01              : 3;
  uint8_t lir                      : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_slope_en_t;

#define IIS3DWB_INTERRUPTS_EN                0x58U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01              : 7;
  uint8_t interrupts_enable        : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t interrupts_enable        : 1;
  uint8_t not_used_01              : 7;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_interrupts_en_t;

#define IIS3DWB_WAKE_UP_THS                  0x5BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t wk_ths                   : 6;
  uint8_t usr_off_on_wu            : 1;
  uint8_t not_used_01              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01              : 1;
  uint8_t usr_off_on_wu            : 1;
  uint8_t wk_ths                   : 6;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_wake_up_ths_t;

#define IIS3DWB_WAKE_UP_DUR                  0x5CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sleep_dur                : 4;
  uint8_t wake_ths_w               : 1;
  uint8_t wake_dur                 : 2;
  uint8_t not_used_01              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01              : 1;
  uint8_t wake_dur                 : 2;
  uint8_t wake_ths_w               : 1;
  uint8_t sleep_dur                : 4;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_wake_up_dur_t;

#define IIS3DWB_MD1_CFG                      0x5EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01              : 5;
  uint8_t int1_wu                  : 1;
  uint8_t not_used_02              : 1;
  uint8_t int1_sleep_change        : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_sleep_change        : 1;
  uint8_t not_used_02              : 1;
  uint8_t int1_wu                  : 1;
  uint8_t not_used_01              : 5;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_md1_cfg_t;

#define IIS3DWB_MD2_CFG                      0x5FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_timestamp           : 1;
  uint8_t not_used_01              : 4;
  uint8_t int2_wu                  : 1;
  uint8_t not_used_02              : 1;
  uint8_t int2_sleep_change        : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_sleep_change        : 1;
  uint8_t not_used_02              : 1;
  uint8_t int2_wu                  : 1;
  uint8_t not_used_01              : 4;
  uint8_t int2_timestamp           : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_md2_cfg_t;

#define IIS3DWB_INTERNAL_FREQ_FINE           0x63U
typedef struct
{
  uint8_t freq_fine                : 8;
} iis3dwb_internal_freq_fine_t;

#define IIS3DWB_X_OFS_USR                    0x73U
#define IIS3DWB_Y_OFS_USR                    0x74U
#define IIS3DWB_Z_OFS_USR                    0x75U
#define IIS3DWB_FIFO_DATA_OUT_TAG            0x78U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tag_parity               : 1;
  uint8_t tag_cnt                  : 2;
  uint8_t tag_sensor               : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tag_sensor               : 5;
  uint8_t tag_cnt                  : 2;
  uint8_t tag_parity               : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb_fifo_data_out_tag_t;

#define IIS3DWB_FIFO_DATA_OUT_X_L            0x79U
#define IIS3DWB_FIFO_DATA_OUT_X_H            0x7AU
#define IIS3DWB_FIFO_DATA_OUT_Y_L            0x7BU
#define IIS3DWB_FIFO_DATA_OUT_Y_H            0x7CU
#define IIS3DWB_FIFO_DATA_OUT_Z_L            0x7DU
#define IIS3DWB_FIFO_DATA_OUT_Z_H            0x7EU

/**
  * @defgroup IIS3DWB_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  iis3dwb_pin_ctrl_t                      pin_ctrl;
  iis3dwb_fifo_ctrl1_t                    fifo_ctrl1;
  iis3dwb_fifo_ctrl2_t                    fifo_ctrl2;
  iis3dwb_fifo_ctrl3_t                    fifo_ctrl3;
  iis3dwb_fifo_ctrl4_t                    fifo_ctrl4;
  iis3dwb_counter_bdr_reg1_t              counter_bdr_reg1;
  iis3dwb_counter_bdr_reg2_t              counter_bdr_reg2;
  iis3dwb_int1_ctrl_t                     int1_ctrl;
  iis3dwb_int2_ctrl_t                     int2_ctrl;
  iis3dwb_ctrl1_xl_t                      ctrl1_xl;
  iis3dwb_ctrl3_c_t                       ctrl3_c;
  iis3dwb_ctrl4_c_t                       ctrl4_c;
  iis3dwb_ctrl5_c_t                       ctrl5_c;
  iis3dwb_ctrl6_c_t                       ctrl6_c;
  iis3dwb_ctrl8_xl_t                      ctrl8_xl;
  iis3dwb_ctrl10_c_t                      ctrl10_c;
  iis3dwb_all_int_src_t                   all_int_src;
  iis3dwb_wake_up_src_t                   wake_up_src;
  iis3dwb_status_reg_t                    status_reg;
  iis3dwb_fifo_status1_t                  fifo_status1;
  iis3dwb_fifo_status2_t                  fifo_status2;
  iis3dwb_slope_en_t                      slope_en;
  iis3dwb_interrupts_en_t                 interrupts_en;
  iis3dwb_wake_up_ths_t                   wake_up_ths;
  iis3dwb_wake_up_dur_t                   wake_up_dur;
  iis3dwb_md1_cfg_t                       md1_cfg;
  iis3dwb_md2_cfg_t                       md2_cfg;
  iis3dwb_internal_freq_fine_t            internal_freq_fine;
  iis3dwb_fifo_data_out_tag_t             fifo_data_out_tag;
  bitwise_t                               bitwise;
  uint8_t                                 byte;
} iis3dwb_reg_t;

/**
  * @}
  *
  */

