STMicroelectronics/stm32ai-modelzoo/human_activity_recognition/getting_started/Drivers/BSP/Components/iis3dwb/iis3dwb_reg.h
typedef enum
{
  IIS3DWB_NO_DECIMATION = 0,
  IIS3DWB_DEC_1         = 1,
  IIS3DWB_DEC_8         = 2,
  IIS3DWB_DEC_32        = 3,
} iis3dwb_odr_ts_batch_t;
int32_t iis3dwb_fifo_timestamp_decimation_set(stmdev_ctx_t *ctx,
                                              iis3dwb_odr_ts_batch_t val);
int32_t iis3dwb_fifo_timestamp_decimation_get(stmdev_ctx_t *ctx,
                                              iis3dwb_odr_ts_batch_t *val);

int32_t iis3dwb_rst_batch_counter_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb_rst_batch_counter_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t iis3dwb_batch_counter_threshold_set(stmdev_ctx_t *ctx,
                                            uint16_t val);
int32_t iis3dwb_batch_counter_threshold_get(stmdev_ctx_t *ctx,
                                            uint16_t *val);

int32_t iis3dwb_fifo_data_level_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t iis3dwb_fifo_status_get(stmdev_ctx_t *ctx,
                                iis3dwb_fifo_status2_t *val);

int32_t iis3dwb_fifo_full_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_fifo_ovr_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb_fifo_wtm_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  IIS3DWB_XL_TAG = 2,
  IIS3DWB_TEMPERATURE_TAG,
  IIS3DWB_TIMESTAMP_TAG,
} iis3dwb_fifo_tag_t;
int32_t iis3dwb_fifo_sensor_tag_get(stmdev_ctx_t *ctx,
                                    iis3dwb_fifo_tag_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* IIS3DWB_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
